app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2)  [["id", 1], ["id", 3]]
---
  def show
    @cart = Cart.includes(cart_items: [:product]).find_by(user_id: params[:user_id])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."product_id" = $2 LIMIT $3  [["cart_id", 1], ["product_id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 2], ["updated_at", "2024-06-10 16:39:52.241456"], ["id", 2]]
---
  def add_item
    product = Product.find(params[:product_id])
    cart_item = @cart.cart_items.find_or_initialize_by(product: product)
    if cart_item.quantity
      cart_item.quantity += params[:quantity].to_i
    else
      cart_item.quantity = params[:quantity].to_i
    end
    if cart_item.save

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."product_id" = $2 LIMIT $3  [["cart_id", 2], ["product_id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 1]]
---
  def remove_item
    cart_item = @cart.cart_items.find_by(product_id: params[:product_id])
    if cart_item
      cart_item.destroy

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 4], ["created_at", "2024-06-10 16:41:30.268575"], ["updated_at", "2024-06-10 16:41:30.268575"]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
---
  def set_cart
    @cart = Cart.find_or_create_by(user_id: params[:user_id])