app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category" = $1  [["category", "Динамики"]]
SELECT "products".* FROM "products"
---
  def index
    if params[:category]
      products = Product.where(category: params[:category])
    else
      products = Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    product = Product.find(params[:id])

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    product = Product.new(product_params)
    if product.save