app/controllers/users/sessions_controller.rb

  def respond_to_on_destroy
    current_user = nil

    if request.headers['Authorization'].present?
      begin
        token = request.headers['Authorization'].split(' ').last
        jwt_payload = JWT.decode(token, Rails.application.credentials.devise_jwt_secret_key!, true, algorithm: 'HS256').first
        Rails.logger.info("JWT Payload: #{jwt_payload.inspect}")
        current_user = User.find_by(jti: jwt_payload['jti'])
---
SELECT "users".* FROM "users" WHERE "users"."jti" = $1 LIMIT $2  [["jti", "d7deab2c-eec5-4f7f-b569-615c97914d0a"], ["LIMIT", 1]]